In [2]:
import pandas as pd
path = r'C:\Users\martu\Documents\martu\UCEMA\2 - PRIMER CUATRI\INFORMATICA\Base de Datos\personas_2011.csv'
personas = pd.read_csv(path, sep=";") 
#Creá un nuevo DataFrame a partir del DataFrame Personas, el cual solo tenga las columnas "persona_id", "anio" y "categoria_conicet_id" (guardalo en una variable llamada pers)
#forma 1:
pers = personas[['persona_id','anio', 'categoria_conicet_id']]
#forma 2:
pers = pd.concat([personas["persona_id"], personas["anio"], personas["categoria_conicet_id"]], axis=1)
pers

       persona_id  anio  categoria_conicet_id
0               1  2011                  -1.0
1               5  2011                   2.0
2               7  2011                   NaN
3              10  2011                  -1.0
4              11  2011                  -1.0
...           ...   ...                   ...
68547      185558  2011                   NaN
68548      185574  2011                   NaN
68549      185583  2011                   NaN
68550      185590  2011                   NaN
68551      185608  2011                   NaN

[68552 rows x 3 columns]

In [4]:
path_cat= r'C:\Users\martu\Documents\martu\UCEMA\2 - PRIMER CUATRI\INFORMATICA\Base de Datos\ref_categoria_conicet.csv'
conicet = pd.read_csv(path_cat, sep=";")
conicet

    categoria_conicet_id  categoria_conicet_descripcion
0                     -1         No pertenece a Conicet
1                      1         Investigador asistente
2                      2           Investigador adjunto
3                      3     Investigador independiente
4                      4         Investigador principal
5                      5          Investigador superior
6                      6               Becario doctoral
7                      7           Becario postdoctoral
8                      8              Personal de apoyo
9                      9                    Gestión CyT
10                    10                        Pasante
11                    11          Otro personal Conicet
12                    12   Investigador correspondiente
13                    13  Investigador superior emérito

In [5]:
#TIPOS DE MERGE
pd.unique(personas.categoria_conicet_id)
#Falta 9,12, 13

array([-1.,  2., nan,  3.,  7.,  5.,  8.,  4.,  1.,  6., 11., 10.])

In [6]:
pd.unique(conicet.categoria_conicet_id)

array([-1,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13],
      dtype=int64)

In [5]:
#Solo las filas en comun, INNER
#Purga los NaN, deja solo datos validos
pd.merge(pers, conicet,how="inner", on = "categoria_conicet_id")

       persona_id  anio  categoria_conicet_id categoria_conicet_descripcion
0               1  2011                  -1.0        No pertenece a Conicet
1              10  2011                  -1.0        No pertenece a Conicet
2              11  2011                  -1.0        No pertenece a Conicet
3              12  2011                  -1.0        No pertenece a Conicet
4              13  2011                  -1.0        No pertenece a Conicet
...           ...   ...                   ...                           ...
48635       60260  2011                  11.0         Otro personal Conicet
48636       79131  2011                  11.0         Otro personal Conicet
48637       85209  2011                  11.0         Otro personal Conicet
48638      146747  2011                  11.0         Otro personal Conicet
48639       47272  2011                  10.0                       Pasante

[48640 rows x 4 columns]

In [7]:
#Utiliza como referencia la columna del df de la derecha. Agrega todos los de la derecha + los que tienen en comun.
#Inner(sin NaN) + 3 filas del 2do df(9, 12 y 13)
pd.merge(pers, conicet,how="right", on = "categoria_conicet_id")

       persona_id    anio  categoria_conicet_id  categoria_conicet_descripcion
0             1.0  2011.0                  -1.0         No pertenece a Conicet
1            10.0  2011.0                  -1.0         No pertenece a Conicet
2            11.0  2011.0                  -1.0         No pertenece a Conicet
3            12.0  2011.0                  -1.0         No pertenece a Conicet
4            13.0  2011.0                  -1.0         No pertenece a Conicet
...           ...     ...                   ...                            ...
48638     79131.0  2011.0                  11.0          Otro personal Conicet
48639     85209.0  2011.0                  11.0          Otro personal Conicet
48640    146747.0  2011.0                  11.0          Otro personal Conicet
48641         NaN     NaN                  12.0   Investigador correspondiente
48642         NaN     NaN                  13.0  Investigador superior emérito

[48643 rows x 4 columns]

In [7]:
#Utiliza la colum ref del df de la izq. Agrega todos los de la izq + los que tienen en comun
#Inner + NaN(datos exclusivos del df de la izq). Seria como tener el def original.
pd.merge(pers, conicet,how="left", on = "categoria_conicet_id")

       persona_id  anio  categoria_conicet_id categoria_conicet_descripcion
0               1  2011                  -1.0        No pertenece a Conicet
1               5  2011                   2.0          Investigador adjunto
2               7  2011                   NaN                           NaN
3              10  2011                  -1.0        No pertenece a Conicet
4              11  2011                  -1.0        No pertenece a Conicet
...           ...   ...                   ...                           ...
68547      185558  2011                   NaN                           NaN
68548      185574  2011                   NaN                           NaN
68549      185583  2011                   NaN                           NaN
68550      185590  2011                   NaN                           NaN
68551      185608  2011                   NaN                           NaN

[68552 rows x 4 columns]

In [8]:
#Une ambos df sin eliminar columnas. Agrega 3 adicionales al final que no encuentra como relacionar con el df original, el resto las relaciona correctamente
pd.merge(pers, conicet,how="outer", on = "categoria_conicet_id")

       persona_id    anio  categoria_conicet_id  categoria_conicet_descripcion
0             1.0  2011.0                  -1.0         No pertenece a Conicet
1            10.0  2011.0                  -1.0         No pertenece a Conicet
2            11.0  2011.0                  -1.0         No pertenece a Conicet
3            12.0  2011.0                  -1.0         No pertenece a Conicet
4            13.0  2011.0                  -1.0         No pertenece a Conicet
...           ...     ...                   ...                            ...
68550    146747.0  2011.0                  11.0          Otro personal Conicet
68551     47272.0  2011.0                  10.0                        Pasante
68552         NaN     NaN                   9.0                    Gestión CyT
68553         NaN     NaN                  12.0   Investigador correspondiente
68554         NaN     NaN                  13.0  Investigador superior emérito

[68555 rows x 4 columns]

In [9]:
#left_on, right_on Se utiliza para relacionar 2 columnas a traves del merge que no tengan el mismo nombre.
pd.merge(pers, conicet, left_on="persona_id", right_on = "categoria_conicet_id")

,persona_id,anio,categoria_conicet_id_x,categoria_conicet_id_y,categoria_conicet_descripcion
0,1,2011,-1.0,1,Investigador asistente
1,5,2011,2.0,5,Investigador superior
2,7,2011,NaN,7,Becario postdoctoral
3,10,2011,-1.0,10,Pasante
4,11,2011,-1.0,11,Otro personal Conicet
5,12,2011,-1.0,12,Investigador correspondiente
6,13,2011,-1.0,13,Investigador superior emérito

In [10]:
#Creá un DataFrame pers2 que contenga las columnas de pers excepto la columna "categoria_conicet_id" y luego probá hacer:
pers2 = pers[['persona_id','anio']]
pd.merge(pers2, conicet,how = "inner", left_on="persona_id", right_on = "categoria_conicet_descripcion")
#Obviamente tira error porque estoy tratando de usar como columna en comun una con datos enteros y otra con str.

ValueError: You are trying to merge on int64 and object columns. If you wish to proceed you should use pd.concat

In [10]:
conicet.dtypes

categoria_conicet_id              int64
categoria_conicet_descripcion    object
dtype: object

In [11]:
#ORDENAMIENTO, COLUMN TO INDEX, SAVE CSV
#pd.df.set_index Index to column
#Mediante este método se puede definir el índice (nombre de las filas) de manera explícita.
'''
print(df.set_index('anio'))
         mes  venta
anio
2012      1    55
2014      4    40
2013      7    84
2014     10    31
 
# Podemos crear múltiples índices
print(df.set_index(['anio', 'mes']))
            venta
anio  mes
2012  1     55
2014  4     40
2013  7     84
2014  10    31
'''

"\nprint(df.set_index('anio'))\n         mes  venta\nanio\n2012      1    55\n2014      4    40\n2013      7    84\n2014     10    31\n \n# Podemos crear múltiples índices\nprint(df.set_index(['anio', 'mes']))\n            venta\nanio  mes\n2012  1     55\n2014  4     40\n2013  7     84\n2014  10    31\n"

In [ ]:
'''
pd.df.sort_values Ordenamiento

Como su nombre lo indica, ordena los valores de un data frame. Este orden se puede hacer tanto por columnas como por filas, ascendente o descendente, y eligiendo dónde deben ir los NaN.

axis: por defecto es 0. Con esto elegimos si se ordenan las columnas o las filas.

ascending: por defecto es True, por lo que se ordena de menor a mayor. Si es False se invierte el orden.

na_position: por defecto es "last", por lo que todos los valores NaN se ordenan al final, pero se puede configurar como "first" para que aparezcan primero.
Para mover los Nan

df = pd.DataFrame({
    'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    'col2': [2, 1, 9, 8, 7, 4],
    'col3': [0, 1, 9, 4, 2, 3],
    'col4': ['a', 'B', 'c', 'D', 'e', 'F']
})
print(df)
  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

# Ordenamos por columna 1:
print(df.sort_values(by=['col1']))
  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

# Se pueden ordenar por más de una columna a la vez:
print(df.sort_values(by=['col1', 'col2']))
  col1  col2  col3 col4
1    A     1     1    B
0    A     2     0    a
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

# Ordenamos de forma descenciente y con los NaN al principio:
print(df.sort_values(by='col1', ascending=False, na_position='first'))
  col1  col2  col3 col4
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F
2    B     9     9    c
0    A     2     0    a
1    A     1     1    B

'''

In [ ]:
'''
pd.df.to_csv

Con este método podemos guardar un data frame en un archivo csv (separado por comas).

path_or_buf: por defecto es None, por lo que si no le damos una ruta donde debe ser guardado nos va a devolver un string. La ruta puede ser completa o relativa.

sep: por defecto el separador es una coma, pero igual que con la apertura, este se puede definir.

na_rep: es la representación de los valores NaN, que por defecto es un string vacío, "", pero también puede ser configurado.

header: por defecto es True, guarda el archivo con los nombres de las columnas.

index: idem a header. Cuando los nombres de los índices son generados automáticamente (del 0 en adelante) es mejor que este parámetro tome el valor False.

Guardar los dataframes en un archivo csv
'''

In [12]:
'''
Ejercicio
Obtener las 10 personas con mayor edad y
'''
personas.edad

0        36
1        48
2        30
3        51
4        39
         ..
68547    -1
68548    55
68549    18
68550    -1
68551    27
Name: edad, Length: 68552, dtype: int64

In [13]:
mayores = personas.sort_values(by="edad", ascending=False).head(10)
mayores.edad

5182     88
47199    85
14292    84
7555     84
34738    84
12158    83
21866    83
11977    83
11852    83
45303    83
Name: edad, dtype: int64

In [14]:
'''
generar un nuevo DataFrame con la información de el id de la persona, el año, su edad y las producciones académicas de los últimos 4 años. 
'''
mayores1 = mayores[['persona_id','anio', 'edad', 'producciones_ult_4_anios', 'categoria_conicet_id']]
mayores1

       persona_id  anio  edad  producciones_ult_4_anios  categoria_conicet_id
5182         6522  2011    88                         8                   5.0
47199       63317  2011    85                         0                  -1.0
14292       18569  2011    84                        11                  -1.0
7555         9442  2011    84                        19                  -1.0
34738       44842  2011    84                        28                  -1.0
12158       15685  2011    83                        12                  -1.0
21866       29049  2011    83                         1                  -1.0
11977       15407  2011    83                         9                  -1.0
11852       15238  2011    83                        22                  -1.0
45303       59467  2011    83                        13                  -1.0

In [15]:
'''Unirlo con el DataFrame conicet y en base a ese generar una tabla con el id de la persona y la descripción de la categoría en conicet. Luego guardar este último DataFrame en un archivo.
'''
path = r'C:\Users\martu\Documents\martu\UCEMA\2 - PRIMER CUATRI\INFORMATICA\Base de Datos\mayores_conicet.csv'
pd.merge(mayores1, conicet, on = "categoria_conicet_id").to_csv(path, sep=";")

In [25]:
#forma 1:
#pers = personas[['persona_id','anio', 'categoria_conicet_id']]
#forma 2:
#pers = pd.concat([personas["persona_id"], personas["anio"], personas["categoria_conicet_id"]], axis=1)

mayores_conicet = pd.read_csv(path, sep=";")
mayores_conicet
tabla = pd.concat([mayores_conicet['persona_id'], mayores_conicet['categoria_conicet_descripcion']], axis=1)
tabla
# o 
#tabla = mayores_conicet[['persona_id', 'categoria_conicet_descripcion']]

   persona_id categoria_conicet_descripcion
0        6522         Investigador superior
1       63317        No pertenece a Conicet
2       18569        No pertenece a Conicet
3        9442        No pertenece a Conicet
4       44842        No pertenece a Conicet
5       15685        No pertenece a Conicet
6       29049        No pertenece a Conicet
7       15407        No pertenece a Conicet
8       15238        No pertenece a Conicet
9       59467        No pertenece a Conicet

In [27]:
path = r'C:\Users\martu\Documents\martu\UCEMA\2 - PRIMER CUATRI\INFORMATICA\Base de Datos\mayores_conicet_descripcion.csv'
tabla.to_csv(path, sep=";")